//======================================================================================================================
//
// チュートリアル処理 [tutorial.h]
// Author:RYO KANDA
//
//======================================================================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "manager.h"

class CWord;

//======================================================================================================================
// マクロ定義
//======================================================================================================================
#define TUTORIAL_BG_NUM			(2)
#define TUTORIAL_BG_POS			(3)

//======================================================================================================================
// クラス定義
//======================================================================================================================
class CTutorial : public CModeBase
{
public:
	CTutorial() {}
	~CTutorial() {}

	static CTutorial *Create();

	void Init();
	void Uninit();
	void Update();
	void Draw();

private:
	void TriangleFlash();

	CWord *m_pBg[TUTORIAL_BG_NUM];
	CWord *m_pEnter;
	CWord *m_Triangle[2];

	D3DXVECTOR3 m_pos[TUTORIAL_BG_POS];

	int m_nOld;									// 前のBG
	int m_nNext;								// 次のBG
};

#endif